Week_7/W7D3/music_app/app/models/user.rb

    def self.find_by_credentials(email, pass)
        user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "pizzaman@pizzafans.com"], ["LIMIT", 1]]

    def reset_session_token!
        self.update!(session_token: SecureRandom::urlsafe_base64)
---
UPDATE "users" SET "session_token" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["session_token", "oOdPmFen3vgd0xiZIY5fiQ"], ["password_digest", "$2a$12$DAcmWRMHRANXxO.mw.ZPr.FME5Blb9yia59/2b7CnRIPG9/TzA7sW"], ["updated_at", "2020-12-08 21:14:34.398769"], ["id", 19]]