Week_7/W7D3/music_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "7JSIwrp94qIBvbNfaKd_Fw"], ["LIMIT", 1]]
---
    def current_user
        return nil if session[:session_token] == nil
        @user = User.find_by(session_token: session[:session_token]) if @user == nil