Week_8/music_app/app/models/user.rb

    def self.find_by_credentials(email, password)
        user = self.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jose@jose.com"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "MCn-c1SBGv6x3-WjCLz58w"], ["updated_at", "2020-12-12 17:02:38.426632"], ["id", 3]]