Week_8/music_app/app/controllers/application_controller.rb

    def current_user
        @current_user = User.find_by(session_token: session[:session_token]) if @current_user == nil
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "MCn-c1SBGv6x3-WjCLz58w"], ["LIMIT", 1]]