Week_8/music_app/app/controllers/bands_controller.rb

  def create
    if signed_in?
      @band = Band.new(band_params)
      if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Luis Fonci"], ["created_at", "2020-12-12 19:06:50.412835"], ["updated_at", "2020-12-12 19:06:50.412835"]]

  def edit
    @band = Band.find_by(id: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @band = Band.find_by(id: params[:id])
    if @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "test"], ["updated_at", "2020-12-12 20:07:46.047795"], ["id", 4]]