Week_8/music_app/app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: session[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"